app/controllers/locations_controller.rb

INSERT INTO "locations" ("location", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["location", ""], ["address", ""], ["created_at", "2015-11-29 07:12:33.489341"], ["updated_at", "2015-11-29 07:12:33.489341"]]
---
  def create

    ## The next step is:: Set location automatically onec the user request a help

    @location = Location.new(location_params)
    #debugger

    respond_to do |format|
      if @location.save

UPDATE "locations" SET "address" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "locations"."id" = ?  [["address", "King saud university"], ["latitude", 24.7224191], ["longitude", 46.6270967], ["updated_at", "2015-11-29 10:55:25.789407"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @location.update(location_params)