app/controllers/rate_controller.rb

  def create

    #debugger
    #render 'new'
    user = User.find_by(email: params[:rate][:email].downcase) #all emails are downcase in out DB.
    score = (params[:rate][:score]).to_i
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "huscs@gmail.com"]]