app/controllers/search_controller.rb

  def search
    if ((params[:search]).present?) && (is_number? (params[:search]))
      score = (params[:search]).to_i
      @users = User.search(score)
---
SELECT "users".* FROM "users" WHERE (rating > 1)