app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "hus@hhhhhh.com"]]
---
	def create

		#render 'new'
		#debugger
		user = User.find_by(email: params[:session][:email].downcase) #all emails are downcase in out DB.
