app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users" WHERE (rating > 5)

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("uname", "upassword", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["uname", "Hussam"], ["upassword", "123456"], ["email", "huscs@ex.com"], ["created_at", "2015-11-26 17:29:18.138630"], ["updated_at", "2015-11-26 17:29:18.138630"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "haldriye@gmail.com"], ["password_digest", "$2a$10$9di3/m8AfRYgwZ.4idr2ueM44AW3K8L0enJO09lCKxzhB7jcR4Mne"], ["updated_at", "2015-11-28 21:49:06.255259"], ["id", 14]]